{
  "word2idx": {
    "<PAD>": 0,
    "<UNK>": 1,
    "计算机科学": 2,
    "系": 3,
    "隶属于": 4,
    "工学院": 5,
    "下设": 6,
    "数学系": 7,
    "理学院": 8,
    "物理系": 9,
    "外国语": 10,
    "学院": 11,
    "人文学院": 12,
    "王晓是": 13,
    "一位": 14,
    "教授": 15,
    "王晓在": 16,
    "大学": 17,
    "任教": 18,
    "李强": 19,
    "是": 20,
    "副教授": 21,
    "在": 22,
    "赵敏": 23,
    "刘伟": 24,
    "讲师": 25,
    "孙丽": 26,
    "张晨": 27,
    "就读于": 28,
    "本科专业": 29,
    "张晨于": 30,
    "2022": 31,
    "年": 32,
    "入学": 33,
    "陈芳": 34,
    "数学": 35,
    "与": 36,
    "应用": 37,
    "陈芳于": 38,
    "2023": 39,
    "刘洋": 40,
    "软件工程": 41,
    "刘洋于": 42,
    "2021": 43,
    "王丽": 44,
    "物理学": 45,
    "王丽于": 46,
    "2020": 47,
    "周杰": 48,
    "英语": 49,
    "周杰于": 50,
    "数据结构": 51,
    "一门": 52,
    "重要": 53,
    "的": 54,
    "课程": 55,
    "共": 56,
    "3": 57,
    "学分": 58,
    "线性代数": 59,
    "4": 60,
    "操作系统": 61,
    "量子": 62,
    "物理": 63,
    "英语课程": 64,
    "2": 65,
    "101": 66,
    "教室": 67,
    "位于": 68,
    "主楼": 69,
    "可": 70,
    "容纳": 71,
    "60": 72,
    "人": 73,
    "202": 74,
    "理科": 75,
    "楼": 76,
    "40": 77,
    "301": 78,
    "工科": 79,
    "80": 80,
    "王老师": 81,
    "从事": 82,
    "教学": 83,
    "工作": 84,
    "指导": 85,
    "学生": 86,
    "进行": 87,
    "科研项目": 88,
    "刘老师": 89,
    "知识": 90,
    "图谱": 91,
    "本学期": 92,
    "开设": 93,
    "Python": 94,
    "程序设计": 95,
    "面向": 96,
    "语义": 97,
    "建模": 98,
    "自然语言": 99,
    "处理": 100,
    "问答": 101,
    "系统": 102,
    "学校": 103,
    "院系": 104,
    "基于": 105,
    "推荐": 106,
    "方法": 107,
    "研究": 108,
    "系是": 109,
    "校园内": 110,
    "场所": 111,
    "实验楼": 112,
    "201": 113,
    "机房": 114,
    "20252025": 115,
    "学年": 116,
    "秋季": 117,
    "学期": 118,
    "有多门": 119,
    "春季": 120,
    "2025": 121,
    "班": 122,
    "期末考试": 123,
    "东区": 124,
    "1": 125,
    "号": 126,
    "宿舍楼": 127,
    "人工智能": 128,
    "协会": 129,
    "社团组织": 130,
    "篮球": 131,
    "社是": 132,
    "周": 133,
    "老师": 134,
    "计算机专业": 135,
    "核心": 136,
    "对于": 137,
    "理工科": 138,
    "非常": 139,
    "讲解": 140,
    "计算机系统": 141,
    "原理": 142,
    "机器": 143,
    "学习": 144,
    "领域": 145,
    "基础": 146,
    "数据库": 147,
    "介绍": 148,
    "数据管理": 149,
    "技术": 150,
    "计算机网络": 151,
    "网络通信": 152,
    "协议": 153,
    "培养": 154,
    "项目": 155,
    "开发": 156,
    "能力": 157,
    "算法": 158,
    "设计": 159,
    "分析": 160,
    "研究生": 161,
    "必修课": 162,
    "编译": 163,
    "程序语言": 164,
    "过程": 165,
    "导论": 166,
    "AI": 167,
    "基本概念": 168,
    "深度": 169,
    "神经网络": 170,
    "模型": 171,
    "热门": 172,
    "方向": 173,
    "计算机": 174,
    "视觉": 175,
    "图像处理": 176,
    "离散数学": 177,
    "基础课": 178,
    "概率论": 179,
    "数理统计": 180,
    "很": 181,
    "有用": 182,
    "这门": 183,
    "三": 184,
    "选修": 185,
    "可以": 186,
    "拓宽": 187,
    "知识面": 188,
    "必修课程": 189,
    "毕业": 190,
    "基本": 191,
    "要求": 192,
    "实验": 193,
    "动手": 194,
    "课程设计": 195,
    "锻炼": 196,
    "综合": 197,
    "入门": 198,
    "高等数学": 199,
    "大学物理": 200,
    "提高": 201,
    "语言": 202,
    "思政": 203,
    "正确": 204,
    "价值观": 205,
    "学术会议": 206,
    "上": 207,
    "发表": 208,
    "了": 209,
    "论文": 210,
    "完成": 211,
    "毕业论文": 212,
    "负责": 213,
    "本科生": 214,
    "博士生": 215,
    "导师": 216,
    "带领": 217,
    "团队": 218,
    "科研": 219,
    "攻关": 220,
    "教师": 221,
    "们": 222,
    "积极参与": 223,
    "教学改革": 224,
    "课堂": 225,
    "知识点": 226,
    "每周": 227,
    "学术讨论": 228,
    "获得": 229,
    "国家自然科学基金": 230,
    "资助": 231,
    "青年教师": 232,
    "参加": 233,
    "技能": 234,
    "培训": 235,
    "学科": 236,
    "竞赛": 237,
    "国际": 238,
    "期刊": 239,
    "高水平": 240,
    "认真": 241,
    "批改": 242,
    "作业": 243,
    "帮助": 244,
    "规划": 245,
    "学术": 246,
    "发展": 247,
    "参与": 248,
    "建设": 249,
    "担任": 250,
    "委员会": 251,
    "委员": 252,
    "水平": 253,
    "高": 254,
    "对": 255,
    "严格": 256,
    "正在": 257,
    "准备": 258,
    "明天": 259,
    "成果奖": 260,
    "博导": 261,
    "招收": 262,
    "三名": 263,
    "办公室": 264,
    "教学楼": 265,
    "三层": 266,
    "布置": 267,
    "课后": 268,
    "深受": 269,
    "欢迎": 270,
    "实验室": 271,
    "撰写": 272,
    "学位": 273,
    "图书馆": 274,
    "自习": 275,
    "新生": 276,
    "教育": 277,
    "活动": 278,
    "毕业生": 279,
    "校园": 280,
    "招聘会": 281,
    "学生会": 282,
    "组织": 283,
    "校园文化": 284,
    "同学": 285,
    "积极": 286,
    "社团活动": 287,
    "食堂": 288,
    "用餐": 289,
    "报告会": 290,
    "申请": 291,
    "奖学金": 292,
    "实习": 293,
    "实践": 294,
    "宿舍": 295,
    "休息": 296,
    "感兴趣": 297,
    "学习成绩": 298,
    "优秀": 299,
    "之间": 300,
    "互相帮助": 301,
    "做": 302,
    "学术论文": 303,
    "国家": 304,
    "军训": 305,
    "找到": 306,
    "理想": 307,
    "代表": 308,
    "学术交流": 309,
    "一起": 310,
    "小组": 311,
    "重点": 312,
    "大量": 313,
    "优秀人才": 314,
    "拥有": 315,
    "先进": 316,
    "设备": 317,
    "多种语言": 318,
    "注重": 319,
    "实力": 320,
    "很强": 321,
    "举办": 322,
    "讲座": 323,
    "经济": 324,
    "管理": 325,
    "商业": 326,
    "人才": 327,
    "软件": 328,
    "企业": 329,
    "合作": 330,
    "办学": 331,
    "信息": 332,
    "开展": 333,
    "前沿技术": 334,
    "电子": 335,
    "工程系": 336,
    "多个": 337,
    "自动化系": 338,
    "控制工程": 339,
    "通信": 340,
    "无线通信": 341,
    "材料科学": 342,
    "新": 343,
    "材料": 344,
    "研发": 345,
    "生命科学": 346,
    "生物": 347,
    "研讨会": 348,
    "系里": 349,
    "有": 350,
    "多位": 351,
    "知名": 352,
    "专业": 353,
    "设置": 354,
    "符合": 355,
    "社会": 356,
    "需求": 357,
    "就业率": 358,
    "系主任": 359,
    "主持": 360,
    "会议": 361,
    "教学评估": 362,
    "课程体系": 363,
    "完善": 364,
    "招生": 365,
    "规模": 366,
    "扩大": 367,
    "建立": 368,
    "校企": 369,
    "基地": 370,
    "好": 371,
    "地方": 372,
    "里": 373,
    "多间": 374,
    "多媒体": 375,
    "配备": 376,
    "体育馆": 377,
    "各种": 378,
    "体育": 379,
    "提供": 380,
    "舒适": 381,
    "住宿": 382,
    "环境": 383,
    "为": 384,
    "师生": 385,
    "餐饮": 386,
    "服务": 387,
    "行政": 388,
    "办公": 389,
    "科技": 390,
    "科研人员": 391,
    "地点": 392,
    "中心": 393,
    "各类": 394,
    "校医院": 395,
    "医疗": 396,
    "操场": 397,
    "锻炼身体": 398,
    "游泳馆": 399,
    "开放": 400,
    "艺术": 401,
    "文艺演出": 402,
    "创新": 403,
    "创业": 404,
    "支持": 405,
    "校史馆": 406,
    "展示": 407,
    "历程": 408,
    "投影仪": 409,
    "和": 410,
    "电脑": 411,
    "设备齐全": 412,
    "藏书": 413,
    "丰富": 414,
    "空调": 415,
    "热水": 416,
    "饭菜": 417,
    "好吃": 418,
    "体育场": 419,
    "运动会": 420,
    "很多": 421,
    "报告厅": 422,
    "五百": 423,
    "环境优美": 424,
    "教学设施": 425,
    "重大": 426,
    "突破": 427,
    "承担": 428,
    "重点项目": 429,
    "研究成果": 430,
    "顶级": 431,
    "发明专利": 432,
    "被": 433,
    "收录": 434,
    "科研成果": 435,
    "转化": 436,
    "实际": 437,
    "数据": 438,
    "需要": 439,
    "仔细分析": 440,
    "聚焦": 441,
    "促进": 442,
    "项目组": 443,
    "定期": 444,
    "召开": 445,
    "报告": 446,
    "提交": 447,
    "给": 448,
    "方": 449,
    "科研经费": 450,
    "用于": 451,
    "购买": 452,
    "成果": 453,
    "同行": 454,
    "认可": 455,
    "博士后": 456,
    "研究员": 457,
    "课题": 458,
    "取得": 459,
    "进展": 460,
    "引用": 461,
    "次数": 462,
    "专利技术": 463,
    "得到": 464,
    "顺利": 465,
    "结题": 466,
    "交流": 467,
    "结果": 468,
    "验证": 469,
    "假设": 470,
    "有效": 471,
    "基金项目": 472,
    "批准": 473,
    "实力雄厚": 474,
    "迎新晚会": 475,
    "社团": 476,
    "招新": 477,
    "吸引": 478,
    "众多": 479,
    "奋力拼搏": 480,
    "邀请": 481,
    "专家": 482,
    "毕业典礼": 483,
    "隆重举行": 484,
    "校庆": 485,
    "丰富多彩": 486,
    "志愿者": 487,
    "公益": 488,
    "文化节": 489,
    "才艺": 490,
    "大赛": 491,
    "激发": 492,
    "创意": 493,
    "交流会": 494,
    "开学典礼": 495,
    "考试": 496,
    "复习": 497,
    "暑期社会": 498,
    "国际交流": 499,
    "视野": 500,
    "专业技能": 501,
    "比赛": 502,
    "优异成绩": 503,
    "晚会节目": 504,
    "精彩纷呈": 505,
    "内容": 506,
    "深入浅出": 507,
    "典礼": 508,
    "仪式": 509,
    "庄重": 510,
    "热烈": 511,
    "志愿": 512,
    "温暖": 513,
    "人心": 514,
    "文艺": 515,
    "汇演": 516,
    "风采": 517,
    "竞赛活动": 518,
    "激烈": 519,
    "精彩": 520,
    "交流活动": 521,
    "增进友谊": 522,
    "收获": 523,
    "满满": 524
  },
  "idx2word": {
    "0": "<PAD>",
    "1": "<UNK>",
    "2": "计算机科学",
    "3": "系",
    "4": "隶属于",
    "5": "工学院",
    "6": "下设",
    "7": "数学系",
    "8": "理学院",
    "9": "物理系",
    "10": "外国语",
    "11": "学院",
    "12": "人文学院",
    "13": "王晓是",
    "14": "一位",
    "15": "教授",
    "16": "王晓在",
    "17": "大学",
    "18": "任教",
    "19": "李强",
    "20": "是",
    "21": "副教授",
    "22": "在",
    "23": "赵敏",
    "24": "刘伟",
    "25": "讲师",
    "26": "孙丽",
    "27": "张晨",
    "28": "就读于",
    "29": "本科专业",
    "30": "张晨于",
    "31": "2022",
    "32": "年",
    "33": "入学",
    "34": "陈芳",
    "35": "数学",
    "36": "与",
    "37": "应用",
    "38": "陈芳于",
    "39": "2023",
    "40": "刘洋",
    "41": "软件工程",
    "42": "刘洋于",
    "43": "2021",
    "44": "王丽",
    "45": "物理学",
    "46": "王丽于",
    "47": "2020",
    "48": "周杰",
    "49": "英语",
    "50": "周杰于",
    "51": "数据结构",
    "52": "一门",
    "53": "重要",
    "54": "的",
    "55": "课程",
    "56": "共",
    "57": "3",
    "58": "学分",
    "59": "线性代数",
    "60": "4",
    "61": "操作系统",
    "62": "量子",
    "63": "物理",
    "64": "英语课程",
    "65": "2",
    "66": "101",
    "67": "教室",
    "68": "位于",
    "69": "主楼",
    "70": "可",
    "71": "容纳",
    "72": "60",
    "73": "人",
    "74": "202",
    "75": "理科",
    "76": "楼",
    "77": "40",
    "78": "301",
    "79": "工科",
    "80": "80",
    "81": "王老师",
    "82": "从事",
    "83": "教学",
    "84": "工作",
    "85": "指导",
    "86": "学生",
    "87": "进行",
    "88": "科研项目",
    "89": "刘老师",
    "90": "知识",
    "91": "图谱",
    "92": "本学期",
    "93": "开设",
    "94": "Python",
    "95": "程序设计",
    "96": "面向",
    "97": "语义",
    "98": "建模",
    "99": "自然语言",
    "100": "处理",
    "101": "问答",
    "102": "系统",
    "103": "学校",
    "104": "院系",
    "105": "基于",
    "106": "推荐",
    "107": "方法",
    "108": "研究",
    "109": "系是",
    "110": "校园内",
    "111": "场所",
    "112": "实验楼",
    "113": "201",
    "114": "机房",
    "115": "20252025",
    "116": "学年",
    "117": "秋季",
    "118": "学期",
    "119": "有多门",
    "120": "春季",
    "121": "2025",
    "122": "班",
    "123": "期末考试",
    "124": "东区",
    "125": "1",
    "126": "号",
    "127": "宿舍楼",
    "128": "人工智能",
    "129": "协会",
    "130": "社团组织",
    "131": "篮球",
    "132": "社是",
    "133": "周",
    "134": "老师",
    "135": "计算机专业",
    "136": "核心",
    "137": "对于",
    "138": "理工科",
    "139": "非常",
    "140": "讲解",
    "141": "计算机系统",
    "142": "原理",
    "143": "机器",
    "144": "学习",
    "145": "领域",
    "146": "基础",
    "147": "数据库",
    "148": "介绍",
    "149": "数据管理",
    "150": "技术",
    "151": "计算机网络",
    "152": "网络通信",
    "153": "协议",
    "154": "培养",
    "155": "项目",
    "156": "开发",
    "157": "能力",
    "158": "算法",
    "159": "设计",
    "160": "分析",
    "161": "研究生",
    "162": "必修课",
    "163": "编译",
    "164": "程序语言",
    "165": "过程",
    "166": "导论",
    "167": "AI",
    "168": "基本概念",
    "169": "深度",
    "170": "神经网络",
    "171": "模型",
    "172": "热门",
    "173": "方向",
    "174": "计算机",
    "175": "视觉",
    "176": "图像处理",
    "177": "离散数学",
    "178": "基础课",
    "179": "概率论",
    "180": "数理统计",
    "181": "很",
    "182": "有用",
    "183": "这门",
    "184": "三",
    "185": "选修",
    "186": "可以",
    "187": "拓宽",
    "188": "知识面",
    "189": "必修课程",
    "190": "毕业",
    "191": "基本",
    "192": "要求",
    "193": "实验",
    "194": "动手",
    "195": "课程设计",
    "196": "锻炼",
    "197": "综合",
    "198": "入门",
    "199": "高等数学",
    "200": "大学物理",
    "201": "提高",
    "202": "语言",
    "203": "思政",
    "204": "正确",
    "205": "价值观",
    "206": "学术会议",
    "207": "上",
    "208": "发表",
    "209": "了",
    "210": "论文",
    "211": "完成",
    "212": "毕业论文",
    "213": "负责",
    "214": "本科生",
    "215": "博士生",
    "216": "导师",
    "217": "带领",
    "218": "团队",
    "219": "科研",
    "220": "攻关",
    "221": "教师",
    "222": "们",
    "223": "积极参与",
    "224": "教学改革",
    "225": "课堂",
    "226": "知识点",
    "227": "每周",
    "228": "学术讨论",
    "229": "获得",
    "230": "国家自然科学基金",
    "231": "资助",
    "232": "青年教师",
    "233": "参加",
    "234": "技能",
    "235": "培训",
    "236": "学科",
    "237": "竞赛",
    "238": "国际",
    "239": "期刊",
    "240": "高水平",
    "241": "认真",
    "242": "批改",
    "243": "作业",
    "244": "帮助",
    "245": "规划",
    "246": "学术",
    "247": "发展",
    "248": "参与",
    "249": "建设",
    "250": "担任",
    "251": "委员会",
    "252": "委员",
    "253": "水平",
    "254": "高",
    "255": "对",
    "256": "严格",
    "257": "正在",
    "258": "准备",
    "259": "明天",
    "260": "成果奖",
    "261": "博导",
    "262": "招收",
    "263": "三名",
    "264": "办公室",
    "265": "教学楼",
    "266": "三层",
    "267": "布置",
    "268": "课后",
    "269": "深受",
    "270": "欢迎",
    "271": "实验室",
    "272": "撰写",
    "273": "学位",
    "274": "图书馆",
    "275": "自习",
    "276": "新生",
    "277": "教育",
    "278": "活动",
    "279": "毕业生",
    "280": "校园",
    "281": "招聘会",
    "282": "学生会",
    "283": "组织",
    "284": "校园文化",
    "285": "同学",
    "286": "积极",
    "287": "社团活动",
    "288": "食堂",
    "289": "用餐",
    "290": "报告会",
    "291": "申请",
    "292": "奖学金",
    "293": "实习",
    "294": "实践",
    "295": "宿舍",
    "296": "休息",
    "297": "感兴趣",
    "298": "学习成绩",
    "299": "优秀",
    "300": "之间",
    "301": "互相帮助",
    "302": "做",
    "303": "学术论文",
    "304": "国家",
    "305": "军训",
    "306": "找到",
    "307": "理想",
    "308": "代表",
    "309": "学术交流",
    "310": "一起",
    "311": "小组",
    "312": "重点",
    "313": "大量",
    "314": "优秀人才",
    "315": "拥有",
    "316": "先进",
    "317": "设备",
    "318": "多种语言",
    "319": "注重",
    "320": "实力",
    "321": "很强",
    "322": "举办",
    "323": "讲座",
    "324": "经济",
    "325": "管理",
    "326": "商业",
    "327": "人才",
    "328": "软件",
    "329": "企业",
    "330": "合作",
    "331": "办学",
    "332": "信息",
    "333": "开展",
    "334": "前沿技术",
    "335": "电子",
    "336": "工程系",
    "337": "多个",
    "338": "自动化系",
    "339": "控制工程",
    "340": "通信",
    "341": "无线通信",
    "342": "材料科学",
    "343": "新",
    "344": "材料",
    "345": "研发",
    "346": "生命科学",
    "347": "生物",
    "348": "研讨会",
    "349": "系里",
    "350": "有",
    "351": "多位",
    "352": "知名",
    "353": "专业",
    "354": "设置",
    "355": "符合",
    "356": "社会",
    "357": "需求",
    "358": "就业率",
    "359": "系主任",
    "360": "主持",
    "361": "会议",
    "362": "教学评估",
    "363": "课程体系",
    "364": "完善",
    "365": "招生",
    "366": "规模",
    "367": "扩大",
    "368": "建立",
    "369": "校企",
    "370": "基地",
    "371": "好",
    "372": "地方",
    "373": "里",
    "374": "多间",
    "375": "多媒体",
    "376": "配备",
    "377": "体育馆",
    "378": "各种",
    "379": "体育",
    "380": "提供",
    "381": "舒适",
    "382": "住宿",
    "383": "环境",
    "384": "为",
    "385": "师生",
    "386": "餐饮",
    "387": "服务",
    "388": "行政",
    "389": "办公",
    "390": "科技",
    "391": "科研人员",
    "392": "地点",
    "393": "中心",
    "394": "各类",
    "395": "校医院",
    "396": "医疗",
    "397": "操场",
    "398": "锻炼身体",
    "399": "游泳馆",
    "400": "开放",
    "401": "艺术",
    "402": "文艺演出",
    "403": "创新",
    "404": "创业",
    "405": "支持",
    "406": "校史馆",
    "407": "展示",
    "408": "历程",
    "409": "投影仪",
    "410": "和",
    "411": "电脑",
    "412": "设备齐全",
    "413": "藏书",
    "414": "丰富",
    "415": "空调",
    "416": "热水",
    "417": "饭菜",
    "418": "好吃",
    "419": "体育场",
    "420": "运动会",
    "421": "很多",
    "422": "报告厅",
    "423": "五百",
    "424": "环境优美",
    "425": "教学设施",
    "426": "重大",
    "427": "突破",
    "428": "承担",
    "429": "重点项目",
    "430": "研究成果",
    "431": "顶级",
    "432": "发明专利",
    "433": "被",
    "434": "收录",
    "435": "科研成果",
    "436": "转化",
    "437": "实际",
    "438": "数据",
    "439": "需要",
    "440": "仔细分析",
    "441": "聚焦",
    "442": "促进",
    "443": "项目组",
    "444": "定期",
    "445": "召开",
    "446": "报告",
    "447": "提交",
    "448": "给",
    "449": "方",
    "450": "科研经费",
    "451": "用于",
    "452": "购买",
    "453": "成果",
    "454": "同行",
    "455": "认可",
    "456": "博士后",
    "457": "研究员",
    "458": "课题",
    "459": "取得",
    "460": "进展",
    "461": "引用",
    "462": "次数",
    "463": "专利技术",
    "464": "得到",
    "465": "顺利",
    "466": "结题",
    "467": "交流",
    "468": "结果",
    "469": "验证",
    "470": "假设",
    "471": "有效",
    "472": "基金项目",
    "473": "批准",
    "474": "实力雄厚",
    "475": "迎新晚会",
    "476": "社团",
    "477": "招新",
    "478": "吸引",
    "479": "众多",
    "480": "奋力拼搏",
    "481": "邀请",
    "482": "专家",
    "483": "毕业典礼",
    "484": "隆重举行",
    "485": "校庆",
    "486": "丰富多彩",
    "487": "志愿者",
    "488": "公益",
    "489": "文化节",
    "490": "才艺",
    "491": "大赛",
    "492": "激发",
    "493": "创意",
    "494": "交流会",
    "495": "开学典礼",
    "496": "考试",
    "497": "复习",
    "498": "暑期社会",
    "499": "国际交流",
    "500": "视野",
    "501": "专业技能",
    "502": "比赛",
    "503": "优异成绩",
    "504": "晚会节目",
    "505": "精彩纷呈",
    "506": "内容",
    "507": "深入浅出",
    "508": "典礼",
    "509": "仪式",
    "510": "庄重",
    "511": "热烈",
    "512": "志愿",
    "513": "温暖",
    "514": "人心",
    "515": "文艺",
    "516": "汇演",
    "517": "风采",
    "518": "竞赛活动",
    "519": "激烈",
    "520": "精彩",
    "521": "交流活动",
    "522": "增进友谊",
    "523": "收获",
    "524": "满满"
  }
}